In [1]:
a = 5

In [2]:
type(a)

int

In [3]:
b = 'Python'

In [4]:
type(b)

str

# Another Heading

# Basic

In [5]:
print(a)
b

5

'Python'

In [6]:
a

5

In [1]:
import pandas as pd

In [2]:
path = 'C:/Users/skesh/Desktop/Production Files/Sample_File.xlsx'

In [17]:
df = pd.read_excel(path).head(4)

In [18]:
#Sample Data Frame
df

   Age  Income
0   24   10000
1   29   25000
2   33   12000
3   24   99000

In [5]:
#covariance matrix
df.cov()

                 Age        Income
Age        19.000000 -9.266667e+04
Income -92666.666667  1.780333e+09

In [6]:
#correlation matrix
df.corr()

             Age    Income
Age     1.000000 -0.503844
Income -0.503844  1.000000

In [11]:
#Age and Income both doubled
#There's no change in the relationship between the 2
df = df*2
df

   Age  Income
0   48   20000
1   58   50000
2   66   24000
3   48  198000

In [15]:
#covariance quadrapled even though there was no relative change between the Age and Income
df.cov()

                  Age        Income
Age         76.000000 -3.706667e+05
Income -370666.666667  7.121333e+09

In [13]:
#correlation still remains the same as there was no change between Age and Income
df.corr()

             Age    Income
Age     1.000000 -0.503844
Income -0.503844  1.000000

In [13]:
df['Income']

0    10000
1    25000
2    12000
3    99000
4      500
5    19000
Name: Income, dtype: int64

#### Mean

In [14]:
df['Income'].mean()

27583.333333333332

In [15]:
df['Income'].median()

15500.0

In [16]:
df['Income'].var()

1293241666.6666667

In [17]:
#standard deviation
df['Income'].std()

35961.66940878394

In [18]:
df

   Age  Income
0   24   10000
1   29   25000
2   33   12000
3   24   99000
4   12     500
5   32   19000

In [20]:
#creating a new column
df['Age_Mean'] = df['Age'].mean()
df['Income_Mean'] = df['Income'].mean()

In [21]:
df

   Age  Income   Age_Mean   Income_Mean
0   24   10000  25.666667  27583.333333
1   29   25000  25.666667  27583.333333
2   33   12000  25.666667  27583.333333
3   24   99000  25.666667  27583.333333
4   12     500  25.666667  27583.333333
5   32   19000  25.666667  27583.333333

In [22]:
#creating dynamic columns
df['Age - Age_Mean'] = df["Age"] - df['Age_Mean']
df['Income - Income_Mean'] = df["Income"] - df['Income_Mean']

df['(Age - Age_Mean)*(Income - Income_Mean)'] = df['Age - Age_Mean']*df['Income - Income_Mean']

In [23]:
df

,Age,Income,Age_Mean,Income_Mean,Age - Age_Mean,Income - Income_Mean,(Age - Age_Mean)*(Income - Income_Mean)
0,24,10000,25.666667,27583.333333,-1.666667,-17583.333333,29305.555556
1,29,25000,25.666667,27583.333333,3.333333,-2583.333333,-8611.111111
2,33,12000,25.666667,27583.333333,7.333333,-15583.333333,-114277.777778
3,24,99000,25.666667,27583.333333,-1.666667,71416.666667,-119027.777778
4,12,500,25.666667,27583.333333,-13.666667,-27083.333333,370138.888889
5,32,19000,25.666667,27583.333333,6.333333,-8583.333333,-54361.111111

In [24]:
df['(Age - Age_Mean)*(Income - Income_Mean)'].sum()/5

20633.333333333325

In [25]:
covariance = df['(Age - Age_Mean)*(Income - Income_Mean)'].sum()/5

In [26]:
print('The covariance of Age and Income',covariance)

The covariance of Age and Income 20633.333333333325

# Day 2

#### String manipulation

In [28]:
str1 = 'Data Science'

In [29]:
str1[0]

'D'

In [30]:
str1[1]

'a'

In [31]:
str1[-1] #last position

'e'

In [32]:
str1[-2] #2nd last position

'c'

In [34]:
#string slicing
str1[0:4]

'Data'

In [35]:
str1[:4] #when the lower limit is not mentioned it assumes it starts from the 1st pos

'Data'

In [36]:
str1[4:]

' Science'

In [37]:
str2 = "AbcAbcAbc"

In [47]:
#str2[start:stop:step]
str2[::2]

'AcbAc'

In [48]:
str3 = "Today is our 2nd session"

In [49]:
len(str3)

24

In [52]:
str3.split(' ') #returns a list of strings

['Today', 'is', 'our', '2nd', 'session']

In [54]:
len(str3.split(' '))

5

In [55]:
city1 = "Mumbai"
city2 = " Mumbai"
city3 = "Mumbai "

In [56]:
city2.strip()

'Mumbai'

In [57]:
city3.strip()

'Mumbai'

In [59]:
city3.strip?  #quick documentation check

In [94]:
details = ["Sree",6,50000.0]

In [95]:
type(details)

list

In [96]:
details[2]

50000.0

In [97]:
#adding an element to an exisiting list
# append --- adds element at the end of the list
details.append("New Element")

In [98]:
details

['Sree', 6, 50000.0, 'New Element']

In [99]:
# extend --- adds multiple elements at the end of the list
details.extend([5,25000.0])

In [100]:
details

['Sree', 6, 50000.0, 'New Element', 5, 25000.0]

In [101]:
details.remove("Sree")

In [102]:
details

[6, 50000.0, 'New Element', 5, 25000.0]

In [103]:
#removing on the basis on index/position
del details[0]

In [104]:
details

[50000.0, 'New Element', 5, 25000.0]

In [105]:
list1 = [112,34,119,90,34]

In [106]:
list1.sort()

In [107]:
list1

[34, 34, 90, 112, 119]

In [108]:
#list of lists
employee_details = [["Sree",6,50000.0],["Prashant",5.5,70000.0],["Kunam",4.5,80000.0]]

In [109]:
len(employee_details)

3

In [110]:
employee_details[0]

['Sree', 6, 50000.0]

In [111]:
employee_details[1]

['Prashant', 5.5, 70000.0]

### Dictionaries

In [115]:
customer_details = {'123':"Sree",
                    '124':"Kunal",
                    '125':"Kabir",
                    '126':"Seth"}

In [116]:
len(customer_details)

4

In [118]:
customer_details['124']

'Kunal'

In [119]:
#adding a new key value pair
customer_details['127'] = "Saurav"

In [120]:
customer_details

{'123': 'Sree', '124': 'Kunal', '125': 'Kabir', '126': 'Seth', '127': 'Saurav'}

In [121]:
customer_details = {'123':["Sree","Mumbai","Deloitte"],
                    '124':["Kunal","TCS"],
                    '125':["Kabir",29,70000,"Data Scientist","Delhi","TCS"],
                    '126':"Seth"}

In [122]:
customer_details["125"]

['Kabir', 29, 70000, 'Data Scientist', 'Delhi', 'TCS']

In [131]:
#fetching the name of the customer with ID 125
customer_details["125"][0]

'Kabir'

In [132]:
customer_details.keys()

dict_keys(['123', '124', '125', '126'])

In [133]:
customer_details.values()

dict_values([['Sree', 'Mumbai', 'Deloitte'], ['Kunal', 'TCS'], ['Kabir', 29, 70000, 'Data Scientist', 'Delhi', 'TCS'], 'Seth'])